#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-TLumwCipMqVsvdaR

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_object.object["2"]: Refreshing state... [id=static/js/787.a3103ff7.chunk.js]
aws_s3_object.object["0"]: Refreshing state... [id=static/css/main.073c9b0a.css]
aws_s3_object.object["5"]: Refreshing state... [id=static/js/main.1af3e22d.js.LICENSE.txt]
aws_s3_object.object["7"]: Refreshing state... [id=static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg]
aws_s3_object.object["6"]: Refreshing state... [id=static/js/main.1af3e22d.js.map]
aws_s3_object.object["1"]: Refreshing state... [id=static/css/main.073c9b0a.css.map]
aws_s3_object.object["4"]: Refreshing state... [id=static/js/main.1af3e22d.js]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_object.object["3"]: Refreshing state... [id=static/js/787.a3103ff7.chunk.js.map]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_object.files["logo192.png"]: Refreshing state... [id=logo192.png]
aws_s3_object.files["logo512.png"]: Refreshing state... [id=logo512.png]
aws_s3_object.files["manifest.json"]: Refreshing state... [id=manifest.json]
aws_s3_object.files["robots.txt"]: Refreshing state... [id=robots.txt]
aws_s3_object.files["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.files["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.files["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_s3_object.files["robots.txt"]: Drift detected (update)
aws_s3_object.files["asset-manifest.json"]: Drift detected (update)
aws_s3_object.files["favicon.ico"]: Drift detected (update)
aws_s3_object.files["index.html"]: Drift detected (update)
aws_s3_object.files["logo192.png"]: Drift detected (update)
aws_s3_object.files["logo512.png"]: Drift detected (update)
aws_s3_object.files["manifest.json"]: Drift detected (update)
aws_s3_object.object["5"]: Drift detected (update)
aws_s3_object.object["6"]: Drift detected (update)
aws_s3_object.object["7"]: Drift detected (update)
aws_s3_object.object["0"]: Drift detected (update)
aws_s3_object.object["1"]: Drift detected (update)
aws_s3_object.object["2"]: Drift detected (update)
aws_s3_object.object["3"]: Drift detected (update)
aws_s3_object.object["4"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
      ~ etag                   = "5cd08cdaf3d44c8ba429d7a15d5a6db0" -> "e83c852ba9db975803c4c5bad2ba6749"
        id                     = "asset-manifest.json"
      ~ source                 = "src/asset-manifest.json" -> "./src/asset-manifest.json"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.files["favicon.ico"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
        id                     = "favicon.ico"
      ~ source                 = "src/favicon.ico" -> "./src/favicon.ico"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
      ~ etag                   = "382292a85fd01c6ac3c74b3638fd59f4" -> "95d219399a97849a80163ed9549c6e27"
        id                     = "index.html"
      ~ source                 = "src/index.html" -> "./src/index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.files["logo192.png"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
        id                     = "logo192.png"
      ~ source                 = "src/logo192.png" -> "./src/logo192.png"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.files["logo512.png"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
        id                     = "logo512.png"
      ~ source                 = "src/logo512.png" -> "./src/logo512.png"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.files["manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
        id                     = "manifest.json"
      ~ source                 = "src/manifest.json" -> "./src/manifest.json"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.files["robots.txt"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
        id                     = "robots.txt"
      ~ source                 = "src/robots.txt" -> "./src/robots.txt"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.object["0"] will be updated in-place
  ~ resource "aws_s3_object" "object" {
        id                     = "static/css/main.073c9b0a.css"
      ~ source                 = "src/static/css/main.073c9b0a.css" -> "./src/static/css/main.073c9b0a.css"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.object["1"] will be updated in-place
  ~ resource "aws_s3_object" "object" {
        id                     = "static/css/main.073c9b0a.css.map"
      ~ source                 = "src/static/css/main.073c9b0a.css.map" -> "./src/static/css/main.073c9b0a.css.map"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.object["2"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "06f18144a0fbe7ab678e4c63cd98974d" -> "d95602c8a8bdb73b00fa5ed23e902214"
      ~ id                     = "static/js/787.a3103ff7.chunk.js" -> (known after apply)
      ~ key                    = "static/js/787.a3103ff7.chunk.js" -> "static/js/787.71e672d5.chunk.js" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "src/static/js/787.a3103ff7.chunk.js" -> "./src/static/js/787.71e672d5.chunk.js"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.object["3"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "33a0822877b384d97f5ab300ce5a6dfa" -> "a124545a507d8b6b2410d0a25e9d7b02"
      ~ id                     = "static/js/787.a3103ff7.chunk.js.map" -> (known after apply)
      ~ key                    = "static/js/787.a3103ff7.chunk.js.map" -> "static/js/787.71e672d5.chunk.js.map" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "src/static/js/787.a3103ff7.chunk.js.map" -> "./src/static/js/787.71e672d5.chunk.js.map"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.object["4"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "8c5e43ddc9b4267fe3b25ca6bbaa018d" -> "f5376be217783190e30afe1471a82404"
      ~ id                     = "static/js/main.1af3e22d.js" -> (known after apply)
      ~ key                    = "static/js/main.1af3e22d.js" -> "static/js/main.9e3090d4.js" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "src/static/js/main.1af3e22d.js" -> "./src/static/js/main.9e3090d4.js"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.object["5"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "static/js/main.1af3e22d.js.LICENSE.txt" -> (known after apply)
      ~ key                    = "static/js/main.1af3e22d.js.LICENSE.txt" -> "static/js/main.9e3090d4.js.LICENSE.txt" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "src/static/js/main.1af3e22d.js.LICENSE.txt" -> "./src/static/js/main.9e3090d4.js.LICENSE.txt"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.object["6"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "0f6c2e8181768b62f9000e181e2d9949" -> "b4030ca9ffb0edccf1937f966b8bf9c0"
      ~ id                     = "static/js/main.1af3e22d.js.map" -> (known after apply)
      ~ key                    = "static/js/main.1af3e22d.js.map" -> "static/js/main.9e3090d4.js.map" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "src/static/js/main.1af3e22d.js.map" -> "./src/static/js/main.9e3090d4.js.map"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.object["7"] will be updated in-place
  ~ resource "aws_s3_object" "object" {
        id                     = "static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"
      ~ source                 = "src/static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" -> "./src/static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 10 to change, 5 to destroy.

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*